#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
; shader debug name: 974c70fd9a823bb29dd8ca9cacddd9f2.pdb
; shader hash: 974c70fd9a823bb29dd8ca9cacddd9f2
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16)
!1 = !DIFile(filename: "F:\5CMyPrograms\5CLearningDirectX12\5CDX12Lib\5CResources\5CShaders\5CImGUI_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 20, type: !18, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PS_INPUT", file: !1, line: 13, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !1, line: 15, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !20, file: !1, line: 16, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 17, baseType: !25, size: 64, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VS_INPUT", file: !1, line: 6, size: 256, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !32, file: !1, line: 8, baseType: !25, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !32, file: !1, line: 9, baseType: !4, size: 128, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !32, file: !1, line: 10, baseType: !25, size: 64, align: 32, offset: 192)
!37 = !{i32 2, !"Dwarf Version", i32 4}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = !{!"dxc 1.2"}
!40 = !{!"F:\5CMyPrograms\5CLearningDirectX12\5CDX12Lib\5CResources\5CShaders\5CImGUI_VS.hlsl", !"cbuffer vertexBuffer : register(b0)\0D\0A{\0D\0A    float4x4 ProjectionMatrix;\0D\0A};\0D\0A\0D\0Astruct VS_INPUT\0D\0A{\0D\0A    float2 pos : POSITION;\0D\0A    float4 col : COLOR0;\0D\0A    float2 uv  : TEXCOORD0;\0D\0A};\0D\0A\0D\0Astruct PS_INPUT\0D\0A{\0D\0A    float4 pos : SV_POSITION;\0D\0A    float4 col : COLOR0;\0D\0A    float2 uv  : TEXCOORD0;\0D\0A};\0D\0A\0D\0APS_INPUT main(VS_INPUT input)\0D\0A{\0D\0A    PS_INPUT output;\0D\0A    output.pos = mul( ProjectionMatrix, float4(input.pos.xy, 0.f, 1.f));\0D\0A    output.col = input.col;\0D\0A    output.uv  = input.uv;\0D\0A    return output;\0D\0A}\0D\0A"}
!41 = !{!"F:\5CMyPrograms\5CLearningDirectX12\5CDX12Lib\5CResources\5CShaders\5CImGUI_VS.hlsl"}
!42 = !{!"/E", !"main", !"/T", !"vs_6_0", !"/Fo", !"F:\5CMyPrograms\5CLearningDirectX12\5Cbuild_vs2019\5Clib\5CDebug\5CImGUI_VS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!43 = !{i32 1, i32 0}
!44 = !{i32 1, i32 5}
!45 = !{!"vs", i32 6, i32 0}
!46 = !{null, null, !47, null}
!47 = !{!48}
!48 = !{i32 0, %dx.alignment.legacy.vertexBuffer* undef, !"vertexBuffer", i32 0, i32 0, i32 1, i32 64, null}
!49 = !{i32 0, %struct.PS_INPUT undef, !50, %struct.VS_INPUT undef, !54, %vertexBuffer undef, !56, %dx.alignment.legacy.vertexBuffer undef, !56}
!50 = !{i32 40, !51, !52, !53}
!51 = !{i32 6, !"pos", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!52 = !{i32 6, !"col", i32 3, i32 16, i32 4, !"COLOR0", i32 7, i32 9}
!53 = !{i32 6, !"uv", i32 3, i32 32, i32 4, !"TEXCOORD0", i32 7, i32 9}
!54 = !{i32 40, !55, !52, !53}
!55 = !{i32 6, !"pos", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!56 = !{i32 64, !57}
!57 = !{i32 6, !"ProjectionMatrix", i32 2, !58, i32 3, i32 0, i32 7, i32 9}
!58 = !{i32 4, i32 4, i32 2}
!59 = !{i32 1, void ()* @main, !60}
!60 = !{!61}
!61 = !{i32 0, !2, !2}
!62 = !{[12 x i32] [i32 10, i32 10, i32 15, i32 15, i32 0, i32 0, i32 240, i32 240, i32 240, i32 240, i32 768, i32 768]}
!63 = !{void ()* @main, !"main", !64, !46, !76}
!64 = !{!65, !72, null}
!65 = !{!66, !69, !71}
!66 = !{i32 0, !"POSITION", i8 9, i8 0, !67, i8 0, i32 1, i8 2, i32 0, i8 0, !68}
!67 = !{i32 0}
!68 = !{i32 3, i32 3}
!69 = !{i32 1, !"COLOR", i8 9, i8 0, !67, i8 0, i32 1, i8 4, i32 1, i8 0, !70}
!70 = !{i32 3, i32 15}
!71 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !67, i8 0, i32 1, i8 2, i32 2, i8 0, !68}
!72 = !{!73, !74, !75}
!73 = !{i32 0, !"SV_Position", i8 9, i8 3, !67, i8 4, i32 1, i8 4, i32 0, i8 0, !70}
!74 = !{i32 1, !"COLOR", i8 9, i8 0, !67, i8 2, i32 1, i8 4, i32 1, i8 0, !70}
!75 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !67, i8 2, i32 1, i8 2, i32 2, i8 0, !68}
!76 = !{i32 0, i64 1}
!77 = !DILocation(line: 20, column: 24, scope: !17)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 20, type: !32)
!79 = !DIExpression(DW_OP_bit_piece, 192, 64)
!80 = !DIExpression(DW_OP_bit_piece, 64, 128)
!81 = !DIExpression(DW_OP_bit_piece, 0, 64)
!82 = !DILocation(line: 23, column: 48, scope: !17)
!83 = !DILocation(line: 23, column: 23, scope: !17)
!84 = !DILocation(line: 23, column: 18, scope: !17)
!85 = !DILocation(line: 23, column: 16, scope: !17)
!86 = !DILocation(line: 24, column: 24, scope: !17)
!87 = !DILocation(line: 24, column: 16, scope: !17)
!88 = !DILocation(line: 25, column: 24, scope: !17)
!89 = !DILocation(line: 25, column: 16, scope: !17)
!90 = !DILocation(line: 26, column: 5, scope: !17)

#endif

const unsigned char g_ImGUI_VS[] = {
  0x44, 0x58, 0x42, 0x43, 0xbc, 0x1d, 0x4a, 0x30, 0x82, 0x66, 0xb5, 0xe0,
  0x93, 0x34, 0x91, 0xd8, 0x6d, 0xcd, 0x11, 0x2e, 0x01, 0x00, 0x00, 0x00,
  0x53, 0x23, 0x00, 0x00, 0x09, 0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00,
